run/fluidisedBed/constant/momentumTransfer
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransfer;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

drag
{
    particles1_dispersedIn_air
    {
        // type            SyamlalOBrien;
        type            GidaspowErgunWenYu;
        residualRe      1e-3;
    }
    particles2_dispersedIn_air
    {
        // type            SyamlalOBrien;
        type            GidaspowErgunWenYu;
        residualRe      1e-3;
    }
    particles1_particles2    
    {
        type            solidSolidDrag;
        gas             air;
        solid1          particles1;
        solid2          particles2;
        E               0.97;
        Cf              1.0;
    }    
}

virtualMass
{}


lift
{}

wallLubrication
{}

turbulentDispersion
{}

// ************************************************************************* //
