run/fluidisedBed/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.particles1 0
    volScalarFieldValue alpha.particles2 0
);

regions
(
    boxToCell
    {
        box (0 0 -0.1) (0.57 0.15 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.air 0.42
            volScalarFieldValue alpha.particles1 0.29
            volScalarFieldValue alpha.particles2 0.29
        );
    }
);


// ************************************************************************* //
